#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main() 
//{
//	//数组的初始化
//	//数据类型 数组名[]= {元素};
//	//也称一维数组
//	int arr[] = { 0,1,2,3,4,5,6,7,9,10 };
//	int length = sizeof(arr) / sizeof(arr[0]);
//
//	for (int i = 0; i < length; i++)
//	{
//		//输出数组的元素
//		printf("%d ",arr[i]);
//		//打印每个数组的地址
//		printf("&arr[%d]=%p\n", i, &arr[i]);
//	}
//}
//随着数组下标的增长，元素的地址也是有规律的递增。所以数组在内存中是连续存放的。
// 数组越界：指访问数组时，引用下标小于0，或大于n-1,则越界访问。
// 数组下标从0开始，有n个元素，则下表范围是{0 -- n-1}
//--------------------------------------------------------------------------------------
//多维数组-二维数组
// int main()
// {
//	 //二维数组的多种初始化
//	 //数据类型 数组名[][]= {元素.......};
//	 //数据类型 数组名[][]= {{元素},{元素},{元素},{元素},{元素}};
//	 int arr[3][4] = {1,2,3,4,2,3,4,5,3,4,5,6 };//三行四列的二维整型数组
//   //int arr[3][4] = {{1,2,3,4},{2,3,4,5},{3,4,5,6}};
//   // 二维数组可以省略行，不能省略列
//   // 
//   //int arr[ ][4] = {{1,2,3,4},{2,3,4,5},{3,4,5,6}};
//	for (int i = 0; i <=2; i++)
//	{
//		for (int j = 0; j <=3; j++)
//		{
//			//打印二维数组
////			printf("%d ", arr[i][j]);
//			//打印每个数组的地址
//		printf("&arr[%d][%d]=%p\n", i,j ,&arr[i][j]);
//		}
//		printf("\n");
//	}
// }
//-----------------------------------------------------------------------
//冒泡排序
//-------------------------------
//非函数
//  
//int main()
//{
//	int arr[] = { 0,9,2,6,4,5,3,7,1,10 };
//	int length = sizeof(arr) / sizeof(arr[0]);
//	printf("****************排序前****************\n");
//	for (int i = 0; i < length; i++)
//	{
//		//输出数组的元素
//		printf("%d ",arr[i]);
//
//	}
//	for (int i = 0; i < length-1; i++)
//	{
//		for (int j = 0; j < length-i-1; j++)
//		{
//			if (arr[j]>arr[j+1])
//			{
//				int t = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = t;
//
//			}
//		}
//	}
//	printf("\n****************排序后****************\n");
//	for (int i = 0; i < length; i++)
//	{
//		//输出数组的元素
//		printf("%d ", arr[i]);
//	}
//}
//-----------------------------------------------------------------------
//数组作为函数参数：将数组作为参数传给函数
//数组传参的写法：1.以数组的形式
//				  2.以指针的形式
//冒泡排序（函数）版

//void sort(int arr[],int length)
//{
//	
//	for (int i = 0; i < length - 1; i++)//循环比较轮次
//	{
//		for (int j = 0; j < length - i - 1; j++)//通过下标进行相邻两个元素进行比较
//			//length-i-1:每循环一轮，都可以确定一个数据的位置，所以要减i
//		{
//			if (arr[j] > arr[j + 1])
//			{
//				int t = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = t;
//
//			}
//		}
//	}
//	//冒泡排序
//	//有n个元素，则循环n-1轮次
//	//每次循环的比较次数：n-(n-1)-1
//}
//
//int main()
//{
//	int arr[] = { 0,9,2,6,4,5,3,7,1,10 };
//	int length = sizeof(arr) / sizeof(arr[0]);
//	printf("*---------------排序前-----------------*\n");
//	for (int i = 0; i < length; i++)
//	{
//		//输出数组的元素
//		printf("%d ",arr[i]);
//
//	}
//			//函数
//			//传参中的实参数组名的本质是数组首元素的地址
//			//而地址应该使用指针变量来接收，所以函数形参中的看似是数组名其实是指针变量等同于 int *arr
//			sort(arr,length);
//
//
//	printf("\n*---------------排序后-----------------*\n");
//	for (int i = 0; i < length; i++)
//	{
//		//输出数组的元素
//		printf("%d ", arr[i]);
//	}
//}

//---------------------------------------------------------------------------------
//数组名的真相
//int main()
//{
//	int arr[10] = {0};
//	//二者相同，说明数组名表示首元素的地址
//	printf("%p\n",arr);
//	printf("%p\n", &arr[0]);
//	//?length为什么等于40呢
//	int length = sizeof(arr) / sizeof(arr[0]);
//	printf("%d\n", length);
//	//真相：数组名可以表示首元素的地址
//	//但是有两个例外：1.sizeof(数组名),这里的数组名表示整个数组，计算的是整个数组的大小，单位是字节
//	//				  2.&数组名（表示取地址），这里的数组名表示整个数组，取出的是整个数组的地址
//	//除了以上两种情况，其余所有情况的数组名都是代表数组首元素的地址
//	printf("-------------------------------------\n");
//	//相差4个字节，
//	printf("%p\n", arr);//arr是数组首元素的地址
//	//首元素 +1
//	printf("%p\n", arr+1);
//	printf("-------------------------------------\n");
//	//相差4个字节，
//	printf("%p\n", &arr[0]);//arr是数组首元素的地址
//	//首元素 +1
//	printf("%p\n", &arr[0]+1);
//	printf("-------------------------------------\n");
//	//相差40个字节，
//	printf("%p\n", arr);//数组的地址
//	//整个数组+1
//	printf("%p\n", arr+1);
//
//}

//那么二维数组呢？

int main()
{
	int arr[3][4];
	int length = sizeof(arr) / sizeof(arr[0]);
	printf("%d\n", length);

	//二维数组的数组名也表示数组首元素的地址
	//二维数组的首元素是哪个一个呢？
	//答：将二维数组看作一维数组，所以二维数组的首元素就是第一行的整个数组

	//求二维数组有几行几列
	//求几行
	int Hang = sizeof(arr) / sizeof(arr[0]);
	//求几列
	int Lie = sizeof(arr[0]) / sizeof(arr[0][0]);
}