#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//指针
//内存单元的编号称为地址（地址也叫指针）
//指针是内存中一个最小单元的编号
//平常说的指针，通常是指指针变量，用来存放地址的变量
//指针是用来存放地址的，地址是唯一标示一块地址空间的
//指针在32位平台是4个字节，在64位平台是8个字节
//x86：32位
//x64：64位
/*
int main()
{
	int a = 10;//a是整型变量，占用4个字节
	int* pa = &a;//&a:取地址，取得是首地址
	//pa是一个指针变量，用来存放地址的
	//本质上指针就是地址
	//指针变量就是一个变量，指针变量是用来存放地址的一个变量
	return 0;
}*/
//
//指针类型
//结论1：指针类型决定了指针在被解引用的时候访问了几个字节
//int*的指针，解引用访问了4个字节
//char*的指针，解引用访问了1个字节
//double*的指针，解引用访问了8个字节
//以此类推。。。
//结论2：指针类型决定了指针+-1操作的时候，跳过几个字节
//决定了指针的步长
/*
int main()
{
	int a = 10;
	int* pa = &a;
	char* pc = (char*)&a;

	printf("pa=%p\n", pa);
	printf("pa+1=%p\n", pa + 1);

	printf("pc=%p\n", pc);
	printf("pc+1=%p\n", pc + 1);
}*/

//野指针：指针指向的位置是不可知的（随机的，不正确的或没有明确限制的）
//野指针的成因：1.指针未初始化
//				2.指针访问越界
//				3.指针指向的空间释放

//int main()
//{
//	//1.
//	//int* p;
//	//p没有初始化，就意味着没有明确的指向
//	//一个局部变量没有初始化，放的就是随机值
//	//*p = 10;//此时非法访问内存了，*p就是野指针
//	
//	//2.
//	//int arr[10] = { 0 };
//	//int* p = arr;//==arr[0];
//	//for (int i = 0; i <=10; i++)
//	//{
//	//	*p = i;
//	//	p++;//当指针指向范围超过数组的范围时，p就是野指针
//	//}
//	return 0;
//}
//3.
/*
int test()
{
	int a = 10;//a是局部变量，使用过后地址空间就会销毁，回归系统
	return &a;
}
int main()
{
	int* p = test();//*p存放的是使用函数后a的地址，而a的地址使用后会销毁，
	//虽然*p仍然可以访问存放的地址，但无妨访问到a的值，也就成野指针

}*/

//如何避免使用野指针：1.指针初始化
//					  2.小心指针越界
//					  3.指针指向空间释放及时置NULL
//					  4.避免返回局部变量的地址
//					  5.指针使用之前检查有效性

// --------------------------------------------------------------
//指针+-整数
//案例：给任意长度数组赋值
//1.使用下标赋值
//int main()
//{
//	int arr[10] = { 0 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (int i = 0; i < sz; i++)
//	{
//		arr[i] = 1;
//	}
//}
////2.使用指针赋值（1）
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (int i = 0; i < sz; i++)
//	{
//		*p = 1;
//		p++;
//		//可简写：*p++=1;
//	}
//}
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = arr;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (int i = 0; i < sz; i++)
//	{
//		*(p + i) = 1;
//		//直接通过加下标值找到目标空间赋值
//		//+0就是arr[0]的地址 ;+1就是arr[1]的地址
//		//因为都是int型，指针+1等于跳过4个字节，就等于从arr[0]直接跨到arr[1];
//	}
//}

//-------------------------------
//指针-指针
//前提：指向同一块空间
//int main()
//{
//	int arr[10] = { 0 };
//	printf("%d\n",&arr[9] - &arr[0]);//?=9
//	//指针-指针：表示两个指针指向的内存位置之间相隔多少个元素
//}
//案例：计算字符串的长度
#include <string.h>
//1.调用库函数
//2.自定义函数：1.循环统计
//				2.递归函数
//				3.指针-指针

//int my_strlen(char* str)
//{
//	/*int count = 0;
//	while (*str != '\0')
//	{
//		count++;
//		str++;
//	}
//	return count;*/
//
//	char* start = str;
//	while (*str != '\0')
//	{
//		str++;
//	}
//	return (str - start);
//}
//
//
//int main()
//{
//	int len = my_strlen("abcdef");
//	printf("%d\n", len);
//}

//数组：一组相同类型元素的集合
//指针：是一个存放地址的变量
//数组可以通过指针访问：*（指针+下标）;

//--------------------------------------------------------------------------
//二级指针变量：是存放一级指针变量的地址
//int main()
//{
//	int a = 10;
//	int* pa = &a;//pa是一个指针变量，一级指针变量
//	*pa = 20;
//	printf("&d\n", a);
//
//	int** ppa = &pa;//ppa也是一个指针变量，二级指针变量
//	//int*是说明ppa指向的对象是int*类型
//	**ppa = 20;
//	printf("&d\n", a);
//}

//-----------------------------------
//指针数组：存放指针的数组

int main()
{
	int a = 10;
	int b = 20;
	int c = 30;
	int arr[10] = { 0 };//数组
	int* pa = &a;
	int* pb = &b;
	int* pc = &c;
	int* parr[10] = { &a,&b,&c };//指针数组

	for (int i = 0; i < 3; i++)
	{
		printf("%d\n", *(parr[i]));
	}
	
}